Revit 2024 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome Property
 Division family cannot be used with the selected edge condition for some widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthSome { get; }
Visual Basic
Public Shared ReadOnly Property DivideVolumesProfilesEdgeMatchForWidthSome As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DivideVolumesProfilesEdgeMatchForWidthSome {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace